
[A_Armageddon H7HeroAbility]
mName="Армагеддон"
mTooltip="Мгновенно наносит от %d.min до %d.max ед. урона от %d.icon магии огня всем отрядам на поле боя."
mTooltipMagicGuild="Мгновенно наносит урон от %d.icon магии огня всем отрядам на поле боя."
mTooltipMagicGuildRankLine="от %d.min до %d.max ед. урона %d.icon"
[A_Burning_Buff H7BaseBuff]
mName="Воспламенение"
mTooltip="Отряд получает %d.max ед. урона от %d.icon магии огня в начале каждого своего хода.\nДлительность (ходов): %durnow."
[A_BurningDetermination H7HeroAbility]
mName="Пламенная решимость"
mTooltip="Увеличивает %buff.buff.stat.icon боевой дух выбранного дружественного отряда на %buff.buff.stat.norm. Длительность (ходов): %buff.buff.durini."
mTooltipMagicGuild="Увеличивает %buff.buff.stat.icon боевой дух выбранного дружественного отряда. Длительность (ходов): %buff.buff.durini."
mTooltipUpgraded="Увеличивает %buff.buff.stat.icon боевой дух всех дружественных отрядов в выбранной области 4x4 на %buff.buff.stat.norm. Длительность (ходов): %buff.buff.durini."
mTooltipMagicGuildRankLine="%buff.buff.stat к %buff.buff.stat.icon боевому духу"
[A_BurningDetermination_Buff H7BaseBuff]
mName="Пламенная решимость"
mTooltip="%stat к %stat.icon боевому духу.\nДлительность (ходов): %durnow."
[A_Fireball H7HeroAbility]
mName="Огненный шар"
mTooltip="Мгновенно наносит всем отрядам в выбранной области 3x3 от %d.min до %d.max ед. урона от %d.icon магии огня."
mTooltipMagicGuild="Мгновенно наносит всем отрядам в выбранной области 3x3 урон от %buff.buff.d.icon магии огня."
mTooltipUpgraded="Мгновенно наносит всем отрядам в выбранной области 3x3 от %d.min до %d.max ед. урона от %d.icon магии огня. Отряды также будут получать от %buff.buff.d.min до %buff.buff.d.max ед. урона от %buff.buff.d.icon магии %ICON_FIRE огня в течение %buff.buff.durini хода(ов)."
mTooltipMagicGuildRankLine="от %d.min до %d.max ед. урона %d.icon"
[A_Firebolt H7HeroAbility]
mName="Огненная стрела"
mTooltip="Мгновенно наносит выбранному вражескому отряду от %d.min до %d.max ед. урона от %d.icon магии огня."
mTooltipMagicGuild="Мгновенно наносит выбранному вражескому отряду урон от %d.icon магии огня."
mTooltipUpgraded="Мгновенно наносит выбранному вражескому отряду от %d.min до %d.max ед. урона от %d.icon магии огня. Отряд также будет получать от %buff.buff.d.min до %buff.buff.d.max ед. урона от %buff.buff.d.icon магии %ICON_FIRE огня в течение %buff.buff.durini хода(ов)."
mTooltipMagicGuildRankLine="от %d.min до %d.max ед. урона %d.icon"
[A_InnerFire_Buff H7BaseBuff]
mName="Внутреннее пламя"
mTooltip="%stat1 к %stat1.icon атаке.\n%stat2 к %stat2.icon инициативе.\nДлительность (ходов): %durnow."
[A_Arkath H7HeroAbility]
mName="Благословение Арката"
mTooltip="В начале следующего боя наносит %buff.buff.special случайн. вражеск. отряду(ам) от %d.min до %d.max ед. урона от %d.icon магии огня."
[A_Nova H7HeroAbility]
mName="Стена пламени"
mTooltip="Наносит выбранному отряду %d ед. урона от %icon_fire магии огня и создает в выбранной области 1x5 стену пламени, которая будет существовать в течение %durini раунда(ов). Существа, оказавшиеся в области действия стены, получают от %buff1.buff.d1.min до %buff1.buff.d1.max ед. урона от %buff1.buff.d1.icon магии огня в начале своего хода."
mTooltipMagicGuild="Наносит выбранному отряду %d ед. урона от %icon_fire магии огня и создает в выбранной области 1x5 стену пламени, которая будет существовать в течение %durini раунда(ов). Существа, оказавшиеся в области действия стены не могут пересечь её и получают от %buff1.buff.d1.min до %buff1.buff.d1.max ед. урона от %buff1.buff.d1.icon магии огня."
mTooltipUpgraded="Наносит выбранному отряду %d ед. урона от %icon_fire магии огня и создает в выбранной области 1x5 стену пламени, которая будет существовать в течение %durini раунда(ов). Существа, оказавшиеся в области действия стены в начале своего хода, получают от %buff1.buff.d1.min до %buff1.buff.d1.max ед. урона от %buff1.buff.d1.icon магии огня. Стена не дает существам пройти и наносит им от %buff3.buff.d.min до %buff3.buff.d.max ед. урона от %ICON_FIRE магии огня в начале каждого их хода в течение %buff3.buff.durini хода(ов)."
mTooltipMagicGuildRankLine="%d ед. урона от %icon_fire магии огня, а также от %buff1.buff.d1.min до %buff1.buff.d1.max ед. урона %buff1.buff.d1.icon"
[A_FireWall_Buff H7BaseBuff]
mName="Стена пламени"
[A_Frenzy_Buff H7BaseBuff]
mName="Берсерк"
[A_BlessingOfArkath H7HeroAbility]
mTooltipMagicGuild="В начале следующего боя наносит урон от %buff.buff.d.icon магии огня случайн. вражеск. отряду(ам)."
mName="Благословение Арката"
mTooltip="В начале следующего боя наносит %buff.buff.special случайн. вражеск. отряду(ам) от %buff.buff.d.min до %buff.buff.d.max ед. урона от %buff.buff.d.icon магии огня."
mTooltipMagicGuildRankLine="от %buff.buff.d.min до %buff.buff.d.max ед. урона %buff.buff.d.icon, кол-во целей: %buff.buff.special"
[Imprinted.A_Armageddon_Imprinted H7HeroAbility]
mName="Армагеддон"
mTooltip="Мгновенно наносит от %d.min до %d.max ед. урона от %d.icon магии огня всем отрядам на поле боя."
[Imprinted.A_Fireball_Imprinted H7HeroAbility]
mName="Огненный шар"
mTooltip="Мгновенно наносит всем отрядам в выбранной области 3x3 от %d.min до %d.max ед. урона от %d.icon магии огня."
[Imprinted.A_Firebolt_Imprinted H7HeroAbility]
mName="Огненная стрела"
mTooltip="Мгновенно наносит выбранному вражескому отряду от %d.min до %d.max ед. урона от %d.icon магии огня."
[Imprinted.A_InnerFire_Imprinted H7HeroAbility]
mName="Внутреннее пламя"
mTooltip="Выбранные существа получают %buff.buff.stat1 к %buff.buff.stat1.icon атаке и %buff.buff.stat2 к %buff.buff.stat2.icon инициативе. Длительность (ходов): %buff.buff.durini."
[Imprinted.A_InnerFire_Imprinted_Buff H7BaseBuff]
mName="Внутреннее пламя"
mTooltip="%stat1 к %stat1.icon атаке.\n%stat2 к %stat2.icon инициативе.\nДлительность (ходов): %durnow."
[A_BlessingOfArkath_Damage H7HeroAbility]
mName="Благословение Арката"
[A_BlessingofArkath_Buff H7BaseBuff]
mName="Благословение Арката"
mTooltip="В начале следующего боя наносит %special случайн. вражеск. отряду(ам) от %d.min до %d.max ед. урона от %d.icon магии огня."
[A_Burning_FromCreature_Buff_Elite H7BaseBuff]
mName="Воспламенение"
mTooltip="Отряд получает %d.max ед. урона от %d.icon магии огня в начале каждого своего хода.\nДлительность (ходов): %durnow."
[A_Burning_FromCreature_Buff_Champion H7BaseBuff]
mName="Воспламенение"
mTooltip="Отряд получает %d.max ед. урона от %d.icon магии огня в начале каждого своего хода.\nДлительность (ходов): %durnow."
[Imprinted.A_BlessingOfArkath_Imprinted H7HeroAbility]
mName="Благословение Арката"
mTooltip="В начале следующего боя наносит %buff.buff.special случайн. вражеск. отряду(ам) от %buff.buff.d.min до %buff.buff.d.max ед. урона от %buff.buff.d.icon магии огня."
[Imprinted.A_BlessingofArkath_Imprinted_Buff H7BaseBuff]
mName="Благословение Арката"
mTooltip="В начале следующего боя наносит %special случайн. вражеск. отряду(ам) от %d.min до %d.max ед. урона от %d.icon магии огня."
[Imprinted.A_BlessingOfArkath_Imprinted_Damage H7HeroAbility]
mName="Благословение Арката"
[Imprinted.A_BurningDetermination_Imprinted H7HeroAbility]
mName="Пламенная решимость"
mTooltip="Увеличивает %buff.buff.stat.icon боевой дух выбранного дружественного отряда на %buff.buff.stat.norm. Длительность (ходов): %buff.buff.durini."
[Imprinted.A_BurningDetermination_Imprinted_Buff H7BaseBuff]
mName="Пламенная решимость"
mTooltip="%stat к %stat.icon боевому духу.\nДлительность (ходов): %durnow."
[Imprinted.A_FireWall_Imprinted H7HeroAbility]
mName="Огненная темница"
mTooltip="Создает в области 2x2 огненную темницу, которая будет существовать в течение %durini раунда(ов). Существа, оказавшиеся в области действия темницы или вошедшие в неё, получают от %buff1.buff.d1.min до %buff1.buff.d1.max ед. урона от %buff1.buff.d1.icon магии огня в начале своего хода. Снижает %icon_movement дальность перемещения этих существ до 0."
[Imprinted.A_FireWall_Imprinted_Buff H7BaseBuff]
mName="Огненная темница"
[Imprinted.A_Frenzy_Imprinted_Buff H7BaseBuff]
mName="Берсерк"
[Imprinted.A_InnerFire_Imprinted_Artifact H7HeroAbility]
mName="Внутреннее пламя"
mTooltip="Выбранные существа получают %buff.buff.stat1 к %buff.buff.stat1.icon атаке и %buff.buff.stat2 к %buff.buff.stat2.icon инициативе. Длительность (ходов): %buff.buff.durini."
[Imprinted.A_InnerFire_Imprinted_Artifact_Buff H7BaseBuff]
mName="Внутреннее пламя"
mTooltip="%stat1 к %stat1.icon атаке.\n%stat2 к %stat2.icon инициативе.\nДлительность (ходов): %durnow."
[A_FireSentry_Obstacle_0_Unskilled H7CombatObstacleObject]
mObstacleName="Огненный страж"
[A_FireSentry_Obstacle_1_Novice H7CombatObstacleObject]
mObstacleName="Огненный страж"
[Imprinted.A_FireSentry_Imprinted H7HeroAbility]
mName="Огненный страж"
mTooltip="Призывает в выбранную свободную область 1x1 огненного стража с %special.val1 ед. здоровья. Заклинание действует в течение 2 раундов или до тех пор, пока огненный страж не будет уничтожен. В конце каждого раунда страж атакует две случайные цели, находящиеся ближе других, а также наносит урон первому противнику, использовавшему атаку дальнего боя в текущем раунде. Каждой атакой страж наносит цели от %special.val2 до %special.val3 ед. урона от %icon_fire магии огня."
[A_FireSentry_Obstacle_2_Expert H7CombatObstacleObject]
mObstacleName="Огненный страж"
[Imprinted.A_BurningDetermination_Imprinted_Artifact_Buff H7BaseBuff]
mName="Пламенная решимость"
mTooltip="%stat к %stat.icon боевому духу.\nДлительность (ходов): %durnow."
[Imprinted.A_BurningDetermination_Imprinted_Artifact H7HeroAbility]
mName="Пламенная решимость"
mTooltip="Повышает %buff.buff.stat.icon боевой дух выбранного дружественного отряда на %buff.buff.stat.norm. Длительность (ходов): %buff.buff.durini."
[A_FireSentry_Obstacle_3_Master H7CombatObstacleObject]
mObstacleName="Огненный страж"
[A_FireSentry H7HeroAbility]
mTooltipMagicGuild="Призывает в выбранную свободную область 1x1 огненного стража. Заклинание действует в течение 2 раундов или до тех пор, пока огненный страж не будет уничтожен. В конце каждого раунда страж атакует две случайные цели, находящиеся ближе других, а также наносит урон первому противнику, использовавшему атаку дальнего боя в текущем раунде."
mTooltipMagicGuildRankLine="Страж с %special.val1 ед. зд. наносит от %special.val2 до %special.val3 ед. урона от %icon_fire магии огня."
mName="Огненный страж"
mTooltip="Призывает в выбранную свободную область 1x1 огненного стража с %special.val1 ед. здоровья. Заклинание действует в течение 2 раундов или до тех пор, пока огненный страж не будет уничтожен. В конце каждого раунда страж атакует две случайные цели, находящиеся ближе других, а также наносит урон первому противнику, использовавшему атаку дальнего боя в текущем раунде. Каждой атакой страж наносит цели от %special.val2 до %special.val3 ед. урона от %icon_fire магии огня."
[Imprinted.A_FireSentry_Imprinted_Obstacle H7CombatObstacleObject]
mObstacleName="Огненный страж"
[A_FireSentry_Obstacle_Ability_Damage H7BaseAbility]
mName="Огненный выстрел"

UCP 1.3 / 7.5_mod

[A_Frenzy_ImprovedBuff_Friendly H7BaseBuff]
mName="Берсерк"
mTooltip=""

[A_Frenzy_ImprovedBuff_Hostile H7BaseBuff]
mName="Берсерк"
mTooltip=""

[A_Frenzy H7HeroAbility]
mName="Берсерк"
mTooltip="Выбранный отряд нападает на случайное существо, оказавшееся в непосредственной близости. При этом отряд получает %buff1.buff.stat1 к %buff1.buff.stat1.icon атаке. Если атакованное существо является дружественным, то оно не отвечает на атаку."
mTooltipMagicGuild="Выбранный отряд нападает на случайное существо, оказавшееся в непосредственной близости. При этом показатель %buff1.buff.stat1.icon атаки отряда снижается или увеличивается, в зависимости от показателя магии героя. Если атакованное существо является дружественным, то оно не отвечает на атаку."
mTooltipUpgraded="Выбранный отряд нападает на случайное существо, оказавшееся в непосредственной близости. При этом отряд получает %buff1.buff.stat1 к %buff1.buff.stat1.icon атаке. Отряд атакует союзников только в том случае, если поблизости нет вражеских существ. Если атакованное существо является дружественным, то оно не отвечает на атаку."
mTooltipMagicGuildRankLine="%buff1.buff.stat1 к %buff1.buff.stat1.icon атаке"

[Imprinted.A_Frenzy_Imprinted H7HeroAbility]
mName="Берсерк"
mTooltip="Выбранный отряд нападает на случайное существо, оказавшееся в непосредственной близости. При этом отряд получает %buff1.buff.stat1 к %buff1.buff.stat1.icon атаке. Если атакованное существо является дружественным, то оно не отвечает на атаку."

[A_Nova H7HeroAbility]
mName="Стена пламени"
mTooltip="Наносит выбранному отряду %d ед. урона от %icon_fire магии огня и создает в выбранной области 1x5 стену пламени, которая будет существовать в течение %durini раунда(ов). Существа, оказавшиеся в области действия стены, получают от %buff1.buff.d1.min до %buff1.buff.d1.max ед. урона от %buff1.buff.d1.icon магии огня в начале своего хода."
mTooltipMagicGuild="Наносит выбранному отряду %d ед. урона от %icon_fire магии огня и создает в выбранной области 1x5 стену пламени, которая будет существовать в течение %durini раунда(ов). Существа, оказавшиеся в области действия стены не могут пересечь её и получают от %buff1.buff.d1.min до %buff1.buff.d1.max ед. урона от %buff1.buff.d1.icon магии огня."
mTooltipUpgraded="Наносит выбранному отряду %d ед. урона от %icon_fire магии огня и создает в выбранной области 1x5 стену пламени, которая будет существовать в течение %durini раунда(ов). Существа, оказавшиеся в области действия стены в начале своего хода, получают от %buff1.buff.d1.min до %buff1.buff.d1.max ед. урона от %buff1.buff.d1.icon магии огня. Стена не дает существам пройти и наносит им от %buff3.buff.d.min до %buff3.buff.d.max ед. урона от %ICON_FIRE магии огня в начале каждого их хода в течение %buff3.buff.durini хода(ов)."
mTooltipMagicGuildRankLine="%d ед. урона от %icon_fire магии огня, а также от %buff1.buff.d1.min до %buff1.buff.d1.max ед. урона %buff1.buff.d1.icon"

[rework.A_BurningDetermination H7HeroAbility]
mName="Внутреннее пламя"
mTooltip="Выбранные существа получают %buff.buff.stat1 к %buff.buff.stat1.icon атаке и %buff.buff.stat2 к %buff.buff.stat2.icon инициативе. Длительность (ходов): %buff.buff.durini."
mTooltipMagicGuild="Показатели %ICON_ATTACK атаки и %ICON_INITIATIVE инициативы выбранного отряда увеличены. Длительность (ходов): %buff.buff.durini."
mTooltipUpgraded="Все дружественные отряды в выбранной области 4x4 получают %buff.buff.stat1 к %buff.buff.stat1.icon атаке и %buff.buff.stat2 к %buff.buff.stat2.icon инициативе. Длительность (ходов): %buff.buff.durini."
mTooltipMagicGuildRankLine="%buff.buff.stat1 к %buff.buff.stat1.icon атаке и %buff.buff.stat2 к %buff.buff.stat2.icon инициативе"